system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libOpenFOAM.so" "libfieldFunctionObjects.so");

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          5e-6;

writeControl    timeStep;

writeInterval   200;

purgeWrite      100;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;


functions
{
    #includeFunc wallShearStress
    #includeFunc pressureDifferenceSurface
    #includeFunc pressureDifferencePatch
    #includeFunc probes
    
    wallShearStress1
    {
        type        wallShearStress;
        libs        ("libfieldFunctionObjects.so");
        writeControl	writeTime;
    }
    
    // field Averages
    fieldAverage1
    {
	type		fieldAverage;
	libs		("libfieldFunctionObjects.so");
	enabled		true;
	writeControl	writeTime;
	
	
	fields
	(
	    U
	    {
		mean		on;
		prime2Mean	on; //RMS
		base		time;
		window		0.01; // 0.01 seconds for 5e-6 Tstep = 2000 samples
	    }

	    p
	    {
		mean		on;
		prime2Mean	off;
		base		time;
		window		0.01;
	    }
 
	    wallShearStress
	    {
		mean		on;
		prime2Mean	off;
		base		time;
		window		0.01;
	    }
	);
    }

}


// ************************************************************************* //
