0.orig/include/pulseInlet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

inlet
{
    type  uniformFixedValue;
    uniformValue sine;

    uniformValueCoeffs
    {
	frequency	1;
	amplitude	0.2;
	scale		(1 0 0);
	level		(0.4 0 0);
	t0		0;
    }
}

// ************************************************************************* //
