system/pressureDifferenceSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Interpolates pressures onto 2 specified triangulated surfaces and
    calculates the difference between the average pressures.

\*---------------------------------------------------------------------------*/

triSurface1 xNormal;
triSurface2 outlet;

#include "pressureDifferenceSurface.cfg"

// ************************************************************************* //
