system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

type            probes;
libs            ("libsampling.so");

writeControl    writeTime;

fields (p pMean U UMean UPrime2Mean wallShearStress wallShearStressMean);
probeLocations
(

#include "../sampleSet_probe"

);

// ************************************************************************* //
